In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [5]:
df = pd.DataFrame(randn(4, 3), ['a', 'b', 'c', 'd'], ['X', 'Y', 'Z'])

In [6]:
df

          X         Y         Z
a -0.047100 -0.854862  1.469123
b -0.265484  0.030650  0.881098
c  1.388277  0.355605  0.033061
d -0.277491  0.221445  0.410155

In [7]:
df > 0

       X      Y     Z
a  False  False  True
b  False   True  True
c   True   True  True
d  False   True  True

In [8]:
bool_df = df > 0

In [9]:
bool_df

       X      Y     Z
a  False  False  True
b  False   True  True
c   True   True  True
d  False   True  True

In [10]:
df[bool_df]

          X         Y         Z
a       NaN       NaN  1.469123
b       NaN  0.030650  0.881098
c  1.388277  0.355605  0.033061
d       NaN  0.221445  0.410155

In [11]:
df[df > 0]

          X         Y         Z
a       NaN       NaN  1.469123
b       NaN  0.030650  0.881098
c  1.388277  0.355605  0.033061
d       NaN  0.221445  0.410155

In [12]:
df

          X         Y         Z
a -0.047100 -0.854862  1.469123
b -0.265484  0.030650  0.881098
c  1.388277  0.355605  0.033061
d -0.277491  0.221445  0.410155

In [14]:
df['X'] > 1

a    False
b    False
c     True
d    False
Name: X, dtype: bool

In [15]:
type(df['X'] > 1)

pandas.core.series.Series

In [16]:
df[df['X'] > 1]

          X         Y         Z
c  1.388277  0.355605  0.033061

In [17]:
df

          X         Y         Z
a -0.047100 -0.854862  1.469123
b -0.265484  0.030650  0.881098
c  1.388277  0.355605  0.033061
d -0.277491  0.221445  0.410155

In [19]:
res_df = df[df['X'] < 0]

In [20]:
res_df

          X         Y         Z
a -0.047100 -0.854862  1.469123
b -0.265484  0.030650  0.881098
d -0.277491  0.221445  0.410155

In [21]:
res_df['Z']

a    1.469123
b    0.881098
d    0.410155
Name: Z, dtype: float64

In [23]:
df[df['X'] < 0]['Z']

a    1.469123
b    0.881098
d    0.410155
Name: Z, dtype: float64

In [25]:
df[df['X'] < 0][['X', 'Z']]

          X         Z
a -0.047100  1.469123
b -0.265484  0.881098
d -0.277491  0.410155

In [26]:
bool_ser = df['X'] < 0

In [27]:
bool_ser

a     True
b     True
c    False
d     True
Name: X, dtype: bool

In [28]:
result_df = df[bool_ser]

In [29]:
result_df

          X         Y         Z
a -0.047100 -0.854862  1.469123
b -0.265484  0.030650  0.881098
d -0.277491  0.221445  0.410155

In [30]:
result_df[['X', 'Z']]

          X         Z
a -0.047100  1.469123
b -0.265484  0.881098
d -0.277491  0.410155

In [31]:
df

          X         Y         Z
a -0.047100 -0.854862  1.469123
b -0.265484  0.030650  0.881098
c  1.388277  0.355605  0.033061
d -0.277491  0.221445  0.410155

In [32]:
df[(df['X'] < 0) & (df['Z'] > 1)]

        X         Y         Z
a -0.0471 -0.854862  1.469123

In [33]:
df[(df['X'] < 0) | (df['Z'] > 1)]

          X         Y         Z
a -0.047100 -0.854862  1.469123
b -0.265484  0.030650  0.881098
d -0.277491  0.221445  0.410155

In [34]:
df.reset_index()

  index         X         Y         Z
0     a -0.047100 -0.854862  1.469123
1     b -0.265484  0.030650  0.881098
2     c  1.388277  0.355605  0.033061
3     d -0.277491  0.221445  0.410155

In [35]:
z1 = [2, 3, 5, 6]

In [36]:
df['Z1'] = z1

In [37]:
df

          X         Y         Z  Z1
a -0.047100 -0.854862  1.469123   2
b -0.265484  0.030650  0.881098   3
c  1.388277  0.355605  0.033061   5
d -0.277491  0.221445  0.410155   6

In [38]:
df.set_index('Z1')

           X         Y         Z
Z1
2  -0.047100 -0.854862  1.469123
3  -0.265484  0.030650  0.881098
5   1.388277  0.355605  0.033061
6  -0.277491  0.221445  0.410155